tap 'homebrew/cask-versions'
tap 'adoptopenjdk/openjdk'

brew 'tmux'
brew 'bash-completion' # autocomplete in bash (tabbing) for many tools
brew 'gcc' # this will take a while...
brew 'gdb'
brew 'git' # although git comes with OS X, this way we get the latest version
brew 'tig' # ncurses based UI for git, just tig in a repo
brew 'mtr' # network diagnostic tool, useful when somebody asks "did the internet just stop?"
brew 'nmap' # network security scanner
brew 'shellcheck' # shell script analyzer
brew 'wget'
brew 'htop'
brew 'make'
brew 'node'
brew 'npm'
brew 'httpie'
brew 'privoxy'
brew 'jenv'

cask 'adoptopenjdk'
cask 'google-chrome'
cask 'iterm2' # great terminal replacement
cask 'google-chat'
cask 'little-snitch' # network monitoring
cask 'virtualbox'
cask 'sourcetree' # Great GUI for Git, Subversion and Mercurial
cask 'docker'
cask 'spark'
cask 'evernote'
cask 'keybase'
cask 'zoomus'
cask 'visual-studio-code'
cask 'wireshark'
cask 'the-unarchiver'

brew 'maven'
brew 'springboot'
