tap 'homebrew/dupes'
tap 'caskroom/versions'

brew 'tmux'
brew 'bash-completion' # autocomplete in bash (tabbing) for many tools
brew 'gcc' # this will take a while...
brew 'gdb'
brew 'git' # although git comes with OS X, this way we get the latest version
brew 'tig' # ncurses based UI for git, just tig in a repo
brew 'mtr' # network diagnostic tool, useful when somebody asks "did the internet just stop?"
brew 'nmap' # network security scanner
brew 'shellcheck' # shell script analyzer
brew 'wget'
brew 'htop'
brew 'make'
brew 'node'
brew 'java'
brew 'maven'

cask 'google-chrome'
cask 'java' # includes JDK
cask 'iterm2' # great terminal replacement
cask 'slack'
cask 'spectacle' # Easy window management
cask 'the-unarchiver' # unarchives most formats
cask 'little-snitch' # network monitoring
cask 'vagrant' # Great to manage development environments (requires VM software)
cask 'virtualbox'
cask 'intellij-idea-ce' # The Ultimate (paid) version is just `intellij-idea`
cask 'flux' # amazing tool that adjusts the color temperature of your monitor to ease it on your eyes
cask 'sourcetree' # Great GUI for Git, Subversion and Mercurial
cask 'sublime-text'
