tap 'caskroom/versions'
tap 'cloudfoundry/tap'
tap 'pivotal/tap'

brew 'tmux'
brew 'bash-completion' # autocomplete in bash (tabbing) for many tools
brew 'gcc' # this will take a while...
brew 'gdb'
brew 'git' # although git comes with OS X, this way we get the latest version
brew 'tig' # ncurses based UI for git, just tig in a repo
brew 'mtr' # network diagnostic tool, useful when somebody asks "did the internet just stop?"
brew 'nmap' # network security scanner
brew 'shellcheck' # shell script analyzer
brew 'wget'
brew 'htop'
brew 'make'
brew 'node'
brew 'npm'
brew 'httpie'
brew 'privoxy'

cask 'google-chrome'
cask 'java8' # includes JDK
cask 'iterm2' # great terminal replacement
cask 'slack'
cask 'spectacle' # Easy window management
cask 'the-unarchiver' # unarchives most formats
cask 'little-snitch' # network monitoring
cask 'vagrant' # Great to manage development environments (requires VM software)
cask 'virtualbox'
cask 'intellij-idea' # The Ultimate (paid) version is just `intellij-idea`, CE is just 'intellij-idea-ce'
cask 'flux' # amazing tool that adjusts the color temperature of your monitor to ease it on your eyes
cask 'sourcetree' # Great GUI for Git, Subversion and Mercurial
cask 'docker'
cask 'spark'
cask 'evernote'
cask 'keybase'
cask 'slack'
cask 'zoomus'
cask 'zoomus-outlook-plugin'
cask 'visual-studio-code'
cask 'atom'
cask 'nvalt'
cask 'wireshark'
cask 'the-unarchiver'

brew 'maven'
brew 'cf-cli'
brew 'springboot'

# Install Atom packages
apm install docblockr
apm install emmet
apm install file-icons
apm install filesize
apm install language-babel
apm install language-docker
apm install language-dotfiles
apm install language-graphql
apm install language-reason
apm install language-viml
apm install linter
apm install linter-alex
apm install linter-eslint
apm install linter-flow
apm install linter-eslint
apm install linter-write-good
apm install pdf-view
apm install pigments
apm install prettier-atom
apm install svg-preview
